;; -*- no-byte-compile: t; -*-
;;; private/rschmukler/packages.el

(package! flycheck)
(package! flycheck-mix)
(package! flycheck-credo)
(package! all-the-icons-ivy)
(package! lux-mode :recipe (:fetcher github :repo "LuxLang/lux" :files ("lux-mode/*")))
(package! paredit)
(package! flycheck-clojure)
(package! erlang)
(package! racket-mode)
(package! geiser)
(package! graphql-mode)
(package! rust-mode)
(package! racer)
(package! flycheck-rust)
(package! intero)
(package! org)
(package! lsp-mode)
(package! lsp-ui :recipe (:fetcher github :repo "emacs-lsp/lsp-ui"))
(package! lsp-haskell)
(package! lsp-rust)
(package! lsp-python)
(package! yapfify)
(package! company-lsp)
(package! dockerfile-mode)
(package! parinfer)
