;; -*- no-byte-compile: t; -*-
;;; private/rschmukler/packages.el

(package! flycheck)
(package! flycheck-mix)
(package! flycheck-credo)
(package! lux-mode :recipe (:fetcher github :repo "LuxLang/lux" :files ("lux-mode/*")))
(package! flycheck-clojure)
(package! erlang)
(package! racket-mode)
(package! geiser)
(package! graphql-mode)
(package! rust-mode)
(package! racer)
(package! flycheck-rust)
(package! intero)
(package! org)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-haskell)
(package! haskell-mode)
(package! flycheck-haskell)
(package! yapfify)
(package! company-lsp)
(package! dockerfile-mode)
(package! aggressive-indent)
(package! evil-matchit :recipe (:fetcher github :repo "redguardtoo/evil-matchit" :commit "7d65b4167b1f0086c2b42b3aec805e47a0d355c4"))
(package! lispyville)
(package! reason-mode)
(package! ob-ipython)
